{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "2166eeab-4631-41af-9614-30351fb49df4",
   "metadata": {},
   "source": [
    "# ICOS metadata and data access"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4878d322-6d48-4e50-b37d-596e3b086bba",
   "metadata": {},
   "source": [
    "Note: In order to use the ICOS Python library (<code>icoscp_core</code>) to download data, you first need to be authenticated. Follow the instructions at [https://icos-carbon-portal.github.io/pylib/icoscp/authentication/](https://icos-carbon-portal.github.io/pylib/icoscp/authentication/)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "02bdc863-a1fe-4cc7-96e3-d4e58c087aeb",
   "metadata": {},
   "outputs": [],
   "source": [
    "from datetime import datetime\n",
    "import requests\n",
    "import pandas as pd\n",
    "from icoscp_core.icos import meta, data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ff85d21-1f24-405b-ad4c-090d3638ae44",
   "metadata": {},
   "source": [
    "## User-defined filters"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "50b92f3f-39b7-4faf-9967-d7b450336b1b",
   "metadata": {},
   "outputs": [],
   "source": [
    "exv = \"EXV013\"\n",
    "dt_min = datetime(2020, 1, 1)\n",
    "dt_max = datetime(2025, 1, 1)\n",
    "sampling_height_min = 0\n",
    "sampling_height_max = 100\n",
    "latitude_min = 45\n",
    "latitude_max = 65\n",
    "longitude_min = 10\n",
    "longitude_max = 20\n",
    "\n",
    "dt_format = \"%Y-%m-%dT%H:%M:%SZ\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "299bab43-1b17-43b3-bbf0-03814ac9e660",
   "metadata": {},
   "source": [
    "#### Format filters so they can be inserted into the SPARQL query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "1810b67b-f7f8-4cc6-bb18-f86e2f49f541",
   "metadata": {},
   "outputs": [],
   "source": [
    "spatial_filters = {\n",
    "    \"?lon > \": longitude_min, \"?lon < \": longitude_max, \"?lat > \": latitude_min, \"?lat < \": latitude_max,\n",
    "    \"?height > \": sampling_height_min, \"?height < \": sampling_height_max\n",
    "}\n",
    "filters = []\n",
    "if dt_min is not None:\n",
    "    filters.append(f\"?end > '{datetime.strftime(dt_min, dt_format)}'^^xsd:dateTime\")\n",
    "if dt_max is not None:\n",
    "    filters.append(f\"?start < '{datetime.strftime(dt_max, dt_format)}'^^xsd:dateTime\")\n",
    "for filter_str, filter_val in spatial_filters.items():\n",
    "    if filter_val is not None:\n",
    "        filters.append(f\"{filter_str}{filter_val}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a454812e-376e-4c1b-965f-70f7cd04173f",
   "metadata": {},
   "source": [
    "## Fetch ICOS data objects matching the selected EXV and the filters"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e131a91d-1145-4ec6-9aa0-99e5d81a194c",
   "metadata": {},
   "source": [
    "#### Get URIs of relevant variables from NVS P07 vocabulary\n",
    "Relevant variables are those which have the same I-ADOPT annotations as the selected EXV. They are found by querying the NVS SPARQL endpoint."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "963986a1-5b8e-42db-a2ec-0c2674a46d44",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['http://vocab.nerc.ac.uk/collection/P07/current/CFV7N47/', 'http://vocab.nerc.ac.uk/collection/P07/current/CFV7N55/', 'http://vocab.nerc.ac.uk/collection/P07/current/CFV8N44/', 'http://vocab.nerc.ac.uk/collection/P07/current/GAXBFKR9/', 'http://vocab.nerc.ac.uk/collection/P07/current/760D4K7J/', 'http://vocab.nerc.ac.uk/collection/P07/current/M8TGRULE/']\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "PREFIX skos:   <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX iop:    <https://w3id.org/iadopt/ont#>\n",
    "SELECT ?p07 WHERE {\n",
    "  VALUES ?exv { <http://vocab.nerc.ac.uk/collection/EXV/current/%s/> }\n",
    "  ?exv iop:hasApplicableProperty ?prop .\n",
    "  ?exv iop:hasApplicableObjectOfInterest ?ooi .\n",
    "  ?exv iop:hasApplicableMatrix ?matrix .\n",
    "  <http://vocab.nerc.ac.uk/collection/P07/current/> skos:member ?p07 .\n",
    "  ?p07 iop:hasProperty ?prop .\n",
    "  ?p07 iop:hasObjectOfInterest ?ooi .\n",
    "  ?p07 iop:hasMatrix ?matrix .\n",
    "}\n",
    "\"\"\" % exv\n",
    "response = requests.get(\"http://vocab.nerc.ac.uk/sparql/sparql\", params={\"query\": query}, headers={\"Accept\": \"application/sparql-results+json\"})\n",
    "response.raise_for_status()\n",
    "results = response.json()\n",
    "p07_vars = [binding[\"p07\"][\"value\"] for binding in results[\"results\"][\"bindings\"]]\n",
    "print(p07_vars)\n",
    "if len(p07_vars) == 0:\n",
    "    raise Exception(f\"No P07 variable matching the selected EXV ({exv}) was found\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ea4d2058-57e3-453b-8fa0-731d78900630",
   "metadata": {},
   "source": [
    "#### Build a SPARQL query for the ICOS SPARQL endpoint\n",
    "The query takes as inputs:\n",
    "- a list of URIs to P07 variables (obtained from the previous step),\n",
    "- a list of temporal and spatial filters (defined earlier)\n",
    "\n",
    "The query will select ICOS datasets which contain data about variables that are mapped (in the ICOS ontology) to any of the listed P07 variables using <code>skos:exactMatch</code>.\n",
    "\n",
    "Note: only most recent (i.e. not deprecated) ICOS level 2 data objects are returned."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "47b7abdf-8224-43df-95ce-719f7a018ce4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX prov: <http://www.w3.org/ns/prov#>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX cpmeta: <http://meta.icos-cp.eu/ontologies/cpmeta/>\n",
      "#PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
      "\n",
      "SELECT ?dobj\n",
      "WHERE {\n",
      "\tVALUES ?externalVar { <http://vocab.nerc.ac.uk/collection/P07/current/CFV7N47/> <http://vocab.nerc.ac.uk/collection/P07/current/CFV7N55/> <http://vocab.nerc.ac.uk/collection/P07/current/CFV8N44/> <http://vocab.nerc.ac.uk/collection/P07/current/GAXBFKR9/> <http://vocab.nerc.ac.uk/collection/P07/current/760D4K7J/> <http://vocab.nerc.ac.uk/collection/P07/current/M8TGRULE/> }\n",
      "    ?valueType skos:exactMatch ?externalVar .\n",
      "    ?spec cpmeta:containsDataset/cpmeta:hasColumn/cpmeta:hasValueType ?valueType .\n",
      "    ?spec cpmeta:hasDataLevel ?level .\n",
      "    ?dobj cpmeta:hasObjectSpec ?spec .\n",
      "    ?dobj cpmeta:wasAcquiredBy ?acq .\n",
      "\t?dobj cpmeta:hasStartTime | (cpmeta:wasAcquiredBy/prov:startedAtTime) ?start .\n",
      "\t?dobj cpmeta:hasEndTime | (cpmeta:wasAcquiredBy/prov:endedAtTime) ?end .\n",
      "    ?acq prov:wasAssociatedWith ?station .\n",
      "    ?acq cpmeta:hasSamplingHeight ?height .\n",
      "    ?station cpmeta:hasLatitude ?lat .\n",
      "    ?station cpmeta:hasLongitude ?lon .\n",
      "    FILTER ( ?end > '2020-01-01T00:00:00Z'^^xsd:dateTime && ?start < '2025-01-01T00:00:00Z'^^xsd:dateTime && ?lon > 10 && ?lon < 20 && ?lat > 45 && ?lat < 65 && ?height > 0 && ?height < 100 )\n",
      "    FILTER NOT EXISTS {[] cpmeta:isNextVersionOf ?dobj}\n",
      "    FILTER (?level = 2)\n",
      "}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "p07_vars_str = \"<\" + \"> <\".join(p07_vars) + \">\"\n",
    "filters_str = \" && \".join(filters)\n",
    "query = \"\"\"\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX prov: <http://www.w3.org/ns/prov#>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX cpmeta: <http://meta.icos-cp.eu/ontologies/cpmeta/>\n",
    "#PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "\n",
    "SELECT ?dobj\n",
    "WHERE {\n",
    "\tVALUES ?externalVar { %s }\n",
    "    ?valueType skos:exactMatch ?externalVar .\n",
    "    ?spec cpmeta:containsDataset/cpmeta:hasColumn/cpmeta:hasValueType ?valueType .\n",
    "    ?spec cpmeta:hasDataLevel ?level .\n",
    "    ?dobj cpmeta:hasObjectSpec ?spec .\n",
    "    ?dobj cpmeta:wasAcquiredBy ?acq .\n",
    "\t?dobj cpmeta:hasStartTime | (cpmeta:wasAcquiredBy/prov:startedAtTime) ?start .\n",
    "\t?dobj cpmeta:hasEndTime | (cpmeta:wasAcquiredBy/prov:endedAtTime) ?end .\n",
    "    ?acq prov:wasAssociatedWith ?station .\n",
    "    ?acq cpmeta:hasSamplingHeight ?height .\n",
    "    ?station cpmeta:hasLatitude ?lat .\n",
    "    ?station cpmeta:hasLongitude ?lon .\n",
    "    FILTER ( %s )\n",
    "    FILTER NOT EXISTS {[] cpmeta:isNextVersionOf ?dobj}\n",
    "    FILTER (?level = 2)\n",
    "}\n",
    "\"\"\" % (p07_vars_str, filters_str)\n",
    "print(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3720d49-da62-4aa9-bbb5-0fe77c581b28",
   "metadata": {},
   "source": [
    "#### POST the SPARQL query to the ICOS SPARQL endpoint\n",
    "\n",
    "This returns a list of URLs to metadata pages of datasets which contain data related to at least one of the P07 variables and which are matching the spatial and temporal filters."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "3d96283f-2f1d-4005-af4c-8924c261b46c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "251\n",
      "['https://meta.icos-cp.eu/objects/6pLNj6DdaSqhlLKuQJS0qxsa', 'https://meta.icos-cp.eu/objects/ZU4dJG4OYWv052zn4YX35K9K', 'https://meta.icos-cp.eu/objects/FunTAtWVhA81A6gXgN-O0lnq', 'https://meta.icos-cp.eu/objects/71m-_WbKKMhxgFqtdeGX2ufr', 'https://meta.icos-cp.eu/objects/__SArJfAjTsKTXUAj12OBmws', 'https://meta.icos-cp.eu/objects/N_r3zUlWqY7Nmlmi86Ty8-CR', 'https://meta.icos-cp.eu/objects/ZTiVWtWXYkBzqR5A5KEMooG-', 'https://meta.icos-cp.eu/objects/rkNaKDVvCZfedPlr7qWSL6YE', 'https://meta.icos-cp.eu/objects/6V0tZfVg3lMjd3aedJZrAfP2', 'https://meta.icos-cp.eu/objects/ttVCWSrHPKUnPu8lKJifYmV7', 'https://meta.icos-cp.eu/objects/ySm70SAyVljBO8jK3TlwwaB-', 'https://meta.icos-cp.eu/objects/5A7_kSn8u2_ltIXPERMfZwpl', 'https://meta.icos-cp.eu/objects/wkMK0TpDAFjnheU2DAA8rKA3', 'https://meta.icos-cp.eu/objects/7arVt77z_somqD4zlhkWsmC9', 'https://meta.icos-cp.eu/objects/YO_XMwtRDUmTZ9QXv-EFEIGX', 'https://meta.icos-cp.eu/objects/E_dl2d-s8Sy72SmZXdNAsXsE', 'https://meta.icos-cp.eu/objects/IpYhSZ4Qa1zWzrxDmKN3Eypc', 'https://meta.icos-cp.eu/objects/wz0QFJvkLDSdYvJ8O3g80yst', 'https://meta.icos-cp.eu/objects/yFZ7_bTQXVf6b8fV1-Rk_T7f', 'https://meta.icos-cp.eu/objects/5aVYkZ9IhYO5UaktGS3eOn6x', 'https://meta.icos-cp.eu/objects/5JtmabPhmNx4Apk5-mtYk628', 'https://meta.icos-cp.eu/objects/5mVYj81z4c9Bg79jLHAmSmMi', 'https://meta.icos-cp.eu/objects/dkFFh4OoahI6sOG6AKCVuSiu', 'https://meta.icos-cp.eu/objects/0eu5J_KdIgJulRIhODKYAM6o', 'https://meta.icos-cp.eu/objects/mnFh4LgGl-vaOHACCGpukj2_', 'https://meta.icos-cp.eu/objects/jpiuFQN_tDaJbnvn3GQ_UHKK', 'https://meta.icos-cp.eu/objects/StFXlzW7aieuu4OZfBODGjnE', 'https://meta.icos-cp.eu/objects/lDYEVddczTYMvRJ3Ms8eLjEd', 'https://meta.icos-cp.eu/objects/fsxv7X_W7Q53HN_I6P1qRDQ9', 'https://meta.icos-cp.eu/objects/3JWWBMOylBDuzXo4uACt8TE3', 'https://meta.icos-cp.eu/objects/mSiWjzUO3MgTmQxzra8d_8lX', 'https://meta.icos-cp.eu/objects/IkbobpVLFSengsBoOoKJdS7J', 'https://meta.icos-cp.eu/objects/Cxk6flz450tv5heD7UDZe2YH', 'https://meta.icos-cp.eu/objects/2kZ3oNhSk0QVRLAu_38PXLD8', 'https://meta.icos-cp.eu/objects/l0_l9cs4ZSIU7lUSU3YID0S5', 'https://meta.icos-cp.eu/objects/KXMlTaKhEsY1PiivcXRYtjLB', 'https://meta.icos-cp.eu/objects/F69m7RQuSm5f689STO5b_S89', 'https://meta.icos-cp.eu/objects/Ett27FMK5VFDwwYIUAn_IRvk', 'https://meta.icos-cp.eu/objects/ywH2OMFp8QXoM84QlnWRtfOu', 'https://meta.icos-cp.eu/objects/-xo5PJSSSAax7S0zmnNxWY1_', 'https://meta.icos-cp.eu/objects/3n12pI5xUtl-_4UFkjW2IXqB', 'https://meta.icos-cp.eu/objects/AuDHfG4gKlF9dIn0r20b_rWu', 'https://meta.icos-cp.eu/objects/10UxNpGg5GO4tMjEEYLSvXcX', 'https://meta.icos-cp.eu/objects/ofSYRN_jK1op1dbWXsgIUHEu', 'https://meta.icos-cp.eu/objects/JY71u5DvfsvoxpksEKxkuvNH', 'https://meta.icos-cp.eu/objects/DD5Q3GTvCcaIHC4GdH_7V_2J', 'https://meta.icos-cp.eu/objects/kAvAnmLNIjWATVeVzz6kGKWX', 'https://meta.icos-cp.eu/objects/ygfF78of2O0GfC_7zHP4c58o', 'https://meta.icos-cp.eu/objects/bD_Y7vV65EpXDoNdCaS6FZzb', 'https://meta.icos-cp.eu/objects/Fb6P77X1NU9eOwatOfpfmj3l', 'https://meta.icos-cp.eu/objects/YxytFBYqAPPqTczBY8j8AbT0', 'https://meta.icos-cp.eu/objects/XE25DFA9V2ZlS7j8elaXAthh', 'https://meta.icos-cp.eu/objects/rlp9VoZGPOCA0eCx1S13ilqt', 'https://meta.icos-cp.eu/objects/F8H4VX80jf-WSZ77qpjL-D4B', 'https://meta.icos-cp.eu/objects/yo806bLGCaa639nPGXce_4Ij', 'https://meta.icos-cp.eu/objects/GWi4xm77sIbLMJJmpjCywlui', 'https://meta.icos-cp.eu/objects/jzZ4mt6rBvV4ZIbJTlAebwYO', 'https://meta.icos-cp.eu/objects/47jbHJOIEoSEEpLSZOw8MbW4', 'https://meta.icos-cp.eu/objects/UMuMnFn6M1E-SGW_i5hVYr9f', 'https://meta.icos-cp.eu/objects/dyx_IcQfTDR7-NHn_smF5_Hz', 'https://meta.icos-cp.eu/objects/gOzfNUTfkpKyKhmpc-DIIV4C', 'https://meta.icos-cp.eu/objects/NVIJSjR8XdUWlVbA-XUhjzuD', 'https://meta.icos-cp.eu/objects/p7aoNlOFhCdlS2SDKHsBA_D1', 'https://meta.icos-cp.eu/objects/f2SlPiJqjL5XvoVmYF7UARUz', 'https://meta.icos-cp.eu/objects/oozmVCj75nO0ISrXDJIC3EUu', 'https://meta.icos-cp.eu/objects/gOzfNUTfkpKyKhmpc-DIIV4C', 'https://meta.icos-cp.eu/objects/NVIJSjR8XdUWlVbA-XUhjzuD', 'https://meta.icos-cp.eu/objects/p7aoNlOFhCdlS2SDKHsBA_D1', 'https://meta.icos-cp.eu/objects/f2SlPiJqjL5XvoVmYF7UARUz', 'https://meta.icos-cp.eu/objects/oozmVCj75nO0ISrXDJIC3EUu', 'https://meta.icos-cp.eu/objects/AcHqfmS9GXLA6tmHzkwTFjBG', 'https://meta.icos-cp.eu/objects/UsGd-qsawGdOF6_HICm4142n', 'https://meta.icos-cp.eu/objects/dtesCAsSvBoKF6EmrdCXbj_Y', 'https://meta.icos-cp.eu/objects/-KPloG93hA9hK7LMEbwgcnkP', 'https://meta.icos-cp.eu/objects/hDTtznjtFH9HN51rBBAoGp9p', 'https://meta.icos-cp.eu/objects/613UFBTKL0nSUxzm6Jyoslyi', 'https://meta.icos-cp.eu/objects/kgB5lruSkedUpWOheIPQRjH8', 'https://meta.icos-cp.eu/objects/k7XWJAWmkVijbMEY4avbrcwO', 'https://meta.icos-cp.eu/objects/MVGNpGeMW4XUJ2k3Jx8q8cIx', 'https://meta.icos-cp.eu/objects/VBcWoPIcAAHgdr7bgDAJRv_9', 'https://meta.icos-cp.eu/objects/OY4CoZWUFp2dZAvsp-QVl0bB', 'https://meta.icos-cp.eu/objects/98ZJGls8yzhBWiCBdoRh3wG0', 'https://meta.icos-cp.eu/objects/ENxHjgVGUmBHIm8gEPO2PiOb', 'https://meta.icos-cp.eu/objects/Ra4Z4uXJHmmX3jieUURVCruQ', 'https://meta.icos-cp.eu/objects/vMtuuxHyeWXfVW1-sjr0PF55', 'https://meta.icos-cp.eu/objects/ghqDaP0y2jOwQdtt9kKoceUe', 'https://meta.icos-cp.eu/objects/GvL3HfHlNySPIwmVOeyDwFrb', 'https://meta.icos-cp.eu/objects/qzhfIjjx4VNTBMhPGq5IMn21', 'https://meta.icos-cp.eu/objects/KblxV2CiPxOdiNAn3IyGAALS', 'https://meta.icos-cp.eu/objects/O1u2AMoEOjyVZxdLAJv4UbvR', 'https://meta.icos-cp.eu/objects/RRZ9rWSXajS8RfB3886tuzhK', 'https://meta.icos-cp.eu/objects/P3BWBdN8X_3ydxdAXan_t1wg', 'https://meta.icos-cp.eu/objects/SvqKJ8I6ngP_9_D71SmTICuI', 'https://meta.icos-cp.eu/objects/BGk52ptb2yIgCcFJZjyYxKCe', 'https://meta.icos-cp.eu/objects/ghsTz2j_u_p1VdoQaDgb7R_1', 'https://meta.icos-cp.eu/objects/ok7oDEYdoJBh0JngE-LpUpkc', 'https://meta.icos-cp.eu/objects/kgHylRIQGHQ1aWWN6hyk5CEI', 'https://meta.icos-cp.eu/objects/M1UeAfyQpD9Rm-IgL2L0YTn2', 'https://meta.icos-cp.eu/objects/tE4MhxNctDdnFYDrcU5UeYP_', 'https://meta.icos-cp.eu/objects/dZmKuyNTBcB3cE8Erp-p56ad']\n"
     ]
    }
   ],
   "source": [
    "resp = requests.post(\"https://meta.icos-cp.eu/sparql\", query)\n",
    "bindings = resp.json()[\"results\"][\"bindings\"]\n",
    "dobjs = [binding[\"dobj\"][\"value\"] for binding in bindings]\n",
    "print(len(dobjs), dobjs[:100], sep=\"\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "be298f3c-045c-471c-9b7c-d93a990a66cd",
   "metadata": {},
   "source": [
    "#### Fetch the data corresponding to the first dataset in the list of URLs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ff54c9d0-2b72-48dc-9a71-90f12b7daf9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "dataset = data.get_columns_as_arrays(meta.get_dobj_meta(dobjs[0]))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd0e37e1-e6ba-48f4-8d65-7fb33d99f74b",
   "metadata": {},
   "source": [
    "#### Convert the results to a pandas DataFrame for visualisation purpose"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "03237852-21c3-4fad-b30d-9e4a2670b2d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "      Flag  NbPoints  Stdev           TIMESTAMP         co2\n",
      "0        N         0 -9.990 2016-05-10 00:00:00         NaN\n",
      "1        N         0 -9.990 2016-05-10 01:00:00         NaN\n",
      "2        N         0 -9.990 2016-05-10 02:00:00         NaN\n",
      "3        N         0 -9.990 2016-05-10 03:00:00         NaN\n",
      "4        N         0 -9.990 2016-05-10 04:00:00         NaN\n",
      "...    ...       ...    ...                 ...         ...\n",
      "77947    O         8  0.053 2025-03-31 19:00:00  432.777008\n",
      "77948    O        12  0.254 2025-03-31 20:00:00  433.003998\n",
      "77949    O         8  0.540 2025-03-31 21:00:00  434.239990\n",
      "77950    O         9  0.625 2025-03-31 22:00:00  434.888000\n",
      "77951    O        11  0.522 2025-03-31 23:00:00  436.722992\n",
      "\n",
      "[77952 rows x 5 columns]\n"
     ]
    }
   ],
   "source": [
    "dataset_df = pd.DataFrame(dataset)\n",
    "print(dataset_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d1cd538c-85a2-46bb-9082-c974f905079c",
   "metadata": {},
   "source": [
    "#### Fetch data from all datasets\n",
    "Additional information on how to use the resulting iterator is provided at [https://icos-carbon-portal.github.io/pylib/icoscp/getting_started/#batch-data-access](https://icos-carbon-portal.github.io/pylib/icoscp/getting_started/#batch-data-access)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b340701d-69b0-4972-b843-8a35a7c0c4e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "dobjs_data = data.batch_get_columns_as_arrays(dobjs)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
